# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
   [-1, 1, EPSA, [1024]] # 10
  ]

# YOLOv5 v6.0 head
head:
  [
   [0, 1, Conv, [32, 1, 1]], # 10 downsample backbone P3
   [2, 1, Conv, [64, 1, 1]], # 11 downsample backbone P4
   [4, 1, Conv, [128, 1, 1]], # 12 downsample backbone P4
   [6, 1, Conv, [256, 1, 1]], # 13 downsample backbone P4
   [10, 1, Conv, [512, 1, 1]], # 14 downsample backbone P4

   [[11, 12, 13], 1, ASFF_3, [128, 2]],   #80   10
   [[12, 13, 14], 1, ASFF_3, [256, 2]],   #40   11
   [[13, 14, 15], 1, ASFF_3, [512, 2]],  #20   12

   [-3, 1, C3, [128, False]], # 14
   [-3, 1, C3, [256, False]], # 15
   [-3, 1, C3, [512, False]], # 20

   [[19, 20, 21], 1, ASFF_3, [128, 0]],   #80   10
   [[19, 20, 21], 1, ASFF_3, [256, 1]],   #40   11
   [[19, 20, 21], 1, ASFF_3, [512, 2]],   #20   18

   [-3, 1, C3, [128, False]],  # 20 (P3/8-small)
   [-3, 1, C3, [256, False]],  # 21 (P4/16-medium)
   [-3, 1, C3, [512, False]],  # 22 (P5/32-large)

   [[25, 26, 27], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
